# 1. Вывести на экран строку "Hello world"
print("Hello world")
#
# 2. Вывести на экран пять звездочек (*)
print("*****")
#
print(5 * "*")
#
# 3. Вывести на экран квадрат 5 на 5 заполненный символами '#'
print("""#####
#####
#####
#####
#####""")
#
print("#####\n#####\n#####\n#####\n#####")

for i in range(5):
    print('#' * 5)
